
## Plan Result (prod)




<pre><code>Plan: 4 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.backend.azurerm_linux_web_app.linux_web_app[0]
  * module.frontend.azurerm_linux_web_app.linux_web_app[0]
  * module.frontend.azurerm_monitor_diagnostic_setting.linux_web_app_diagnostics[0]
  * module.frontend.azurerm_private_endpoint.linux_webapp_private_endpoint[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.backend.azurerm_linux_web_app.linux_web_app[0] will be created
  + resource "azurerm_linux_web_app" "linux_web_app" {
      + client_affinity_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Required"
      + custom_domain_verification_id                  = (sensitive value)
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "uksouth"
      + name                                           = "plum-backend"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + resource_group_name                            = "plum-shared-infrastructure-prod"
      + service_plan_id                                = "/subscriptions/00000000-0000-0000-0000-000000000000/resourceGroups/plum-shared-infrastructure-aat/providers/Microsoft.Web/serverFarms/plum-backend-asp"
      + site_credential                                = (sensitive value)
      + virtual_network_backup_restore_enabled         = false
      + virtual_network_subnet_id                      = "/subscriptions/00000000-0000-0000-0000-000000000000/resourceGroups/aks-infra-cft-aat-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/aat"
      + vnet_image_pull_enabled                        = false
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + auth_settings_v2 {
          + auth_enabled             = true
          + default_provider         = "azureactivedirectory"
          + forward_proxy_convention = "NoProxy"
          + http_route_api_prefix    = "/.auth"
          + require_authentication   = true
          + require_https            = true
          + runtime_version          = "~1"
          + unauthenticated_action   = "Return401"

          + active_directory_v2 {
              + client_id                  = "00000000-0000-0000-0000-000000000000"
              + client_secret_setting_name = "MICROSOFT_PROVIDER_AUTHENTICATION_SECRET"
              + login_parameters           = {
                  + "scope" = "openid profile email offline_access"
                }
              + tenant_auth_endpoint       = "https://login.microsoftonline.com/531ff96d-0ae9-462a-8d2d-bec7c0b42082/v2.0"
            }

          + login {
              + allowed_external_redirect_urls    = [
                  + "https://my-product-dev.example.com",
                  + "https://my-product-dev.example.com/",
                ]
              + cookie_expiration_convention      = "FixedTime"
              + cookie_expiration_time            = "08:00:00"
              + nonce_expiration_time             = "00:05:00"
              + preserve_url_fragments_for_logins = false
              + token_refresh_extension_time      = 168
              + token_store_enabled               = true
              + validate_nonce                    = true
            }
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + logs {
          + detailed_error_messages = true
          + failed_request_tracing  = true

          + application_logs {
              + file_system_level = "Verbose"
            }

          + http_logs {
              + file_system {
                  + retention_in_days = 90
                  + retention_in_mb   = 100
                }
            }
        }

      + site_config {
          + always_on                               = true
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = 2
          + health_check_path                       = "/health"
          + http2_enabled                           = true
          + ip_restriction_default_action           = "Allow"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + docker_image_name   = "hello-world:latest"
              + docker_registry_url = "https://mcr.microsoft.com"
            }

          + cors {
              + allowed_origins     = [
                  + "https://my-product-dev.example.com",
                  + "https://my-product-dev.example.com/",
                ]
              + support_credentials = true
            }
        }
    }

  # module.frontend.azurerm_linux_web_app.linux_web_app[0] will be created
  + resource "azurerm_linux_web_app" "linux_web_app" {
      + client_affinity_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Required"
      + custom_domain_verification_id                  = (sensitive value)
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "uksouth"
      + name                                           = "plum-frontend"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + resource_group_name                            = "plum-shared-infrastructure-prod"
      + service_plan_id                                = "/subscriptions/00000000-0000-0000-0000-000000000000/resourceGroups/plum-shared-infrastructure-aat/providers/Microsoft.Web/serverFarms/plum-frontend-asp"
      + site_credential                                = (sensitive value)
      + virtual_network_backup_restore_enabled         = false
      + virtual_network_subnet_id                      = "/subscriptions/00000000-0000-0000-0000-000000000000/resourceGroups/aks-infra-cft-aat-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/aat"
      + vnet_image_pull_enabled                        = false
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + auth_settings_v2 {
          + auth_enabled             = true
          + default_provider         = "azureactivedirectory"
          + forward_proxy_convention = "NoProxy"
          + http_route_api_prefix    = "/.auth"
          + require_authentication   = true
          + require_https            = true
          + runtime_version          = "~1"
          + unauthenticated_action   = "RedirectToLoginPage"

          + active_directory_v2 {
              + client_id                  = "00000000-0000-0000-0000-000000000000"
              + client_secret_setting_name = "MICROSOFT_PROVIDER_AUTHENTICATION_SECRET"
              + login_parameters           = {
                  + "scope" = "openid profile email offline_access"
                }
              + tenant_auth_endpoint       = "https://login.microsoftonline.com/531ff96d-0ae9-462a-8d2d-bec7c0b42082/v2.0"
            }

          + login {
              + allowed_external_redirect_urls    = [
                  + "https://my-product-dev.example.com",
                  + "https://my-product-dev.example.com/",
                ]
              + cookie_expiration_convention      = "FixedTime"
              + cookie_expiration_time            = "08:00:00"
              + nonce_expiration_time             = "00:05:00"
              + preserve_url_fragments_for_logins = false
              + token_refresh_extension_time      = 168
              + token_store_enabled               = true
              + validate_nonce                    = true
            }
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + logs {
          + detailed_error_messages = true
          + failed_request_tracing  = true

          + application_logs {
              + file_system_level = "Verbose"
            }

          + http_logs {
              + file_system {
                  + retention_in_days = 90
                  + retention_in_mb   = 100
                }
            }
        }

      + site_config {
          + always_on                               = true
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + http2_enabled                           = false
          + ip_restriction_default_action           = "Allow"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + docker_image_name   = "hello-world:latest"
              + docker_registry_url = "https://mcr.microsoft.com"
            }
        }
    }

  # module.frontend.azurerm_monitor_diagnostic_setting.linux_web_app_diagnostics[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "linux_web_app_diagnostics" {
      + eventhub_authorization_rule_id = "/subscriptions/00000000-0000-0000-0000-000000000000/resourceGroups/plum-shared-infrastructure-aat/providers/Microsoft.EventHub/namespaces/plum-eh/authorizationRules/plum-eh-auth-rule"
      + eventhub_name                  = "plum-frontend-eh"
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + name                           = "plum-frontend-diagnostics"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category       = "AppServiceAppLogs"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category       = "AppServiceAuditLogs"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category       = "AppServiceAuthenticationLogs"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category       = "AppServiceConsoleLogs"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category       = "AppServiceHTTPLogs"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category       = "AppServiceIPSecAuditLogs"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category       = "AppServicePlatformLogs"
            # (1 unchanged attribute hidden)
        }

      + enabled_metric {
          + category = "AllMetrics"
        }

      + metric (known after apply)
    }

  # module.frontend.azurerm_private_endpoint.linux_webapp_private_endpoint[0] will be created
  + resource "azurerm_private_endpoint" "linux_webapp_private_endpoint" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "plum-frontend-pe"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "plum-shared-infrastructure-prod"
      + subnet_id                = "/subscriptions/00000000-0000-0000-0000-000000000000/resourceGroups/aks-infra-cft-aat-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/aat"

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "plum-frontend-psc"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "sites",
            ]
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":179,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->